"use strict";

let square = prompt('Введите значение площади основания целиндра', '2');
let height = prompt('Введите высоту целиндра', '2');
let x = "------------------------<br>";
let y = "************<br>";
let v = square * height;

document.write(y + "Обьем цилиндра с площадью основы S = " + square + " и высотой H =" 
+ height + " равен:" + "<br>" + x + "V = " + v + " ." + "<br>" + x + "End.");

// _________________________________________________________________

// let a = +prompt("Введите значение переменной а", "1");
// let x = (a % 2 == 0) ?  alert("число четное: " + a) : alert("число нечетное: " + a);

// let b = +prompt("Введите значение переменной b", "1");
// let z = (b % 2 == 0) ?  alert("число четное: " + b) : alert("число нечетное: " + b);
// let c = +prompt("Введите значение переменной c", "1");
// let y = (c % 2 == 0) ?  alert("число четное: " + c) : alert("число нечетное: " + c);


// let sum = a + b +c;
// alert("Сумма введенных Вами чисел равна: " + sum);




// ___2 способ_____

// if (a % 2 == 0) { 
//   alert("число четное: " + a);
// } else {
//   alert("число нечетное: " + a );
// }

// if (b % 2 == 0) { 
//   alert("число четное: " + b);
// } else {
//   alert("число нечетное: " + b );
// }

// if (c % 2 == 0) { 
//   alert("число четное: " + c);
// } else {
//   alert("число нечетное: " + c);
// }












